   ID DIVISION.
       PROGRAM-ID. HELLO.

      *    THIS IS ANEW ABCDefgh
      *
      *    THIS PROGRAM WILL RECEIVE A DATE AND COVERT THE DATE TO
      *    AN INTEGER IN A CALLED PROGRAM TO DETERMINE DAYS FROM
      *    CURRENT DATE.
      * TRAINING PURPOSE1


      NEW training 1,23,4,5,6

      NEW training 1,2,3,4

